export const fundamentalsCollection = {
  name: "충북대 소프트웨어학과 커리큘럼",
  areas: [
    {
      name: "1학년",
      skills: [
        {
          name: "1학년",
          skills: [
            {
              name: "1학기",
              description: {
                text: "전공 필수 3학점, 전공 선택 3학점"
              },

              skills: [
                {
                  name: "이산수학",
                  description: {
                    text: "컴퓨터과학 및 디지털정보처리 분야의 수학적 기초가 되는 논리, 함수, 관계를 포함한 집합, 알고리즘, 수학적 귀납법 및 증명방법, 그래프, 트리, 부울 대수 등을 학습한다.",
                  },
                },
                {
                  name: "창의공학설계",
                  description: {
                    text: "여러 가지 다양한 문제의 해결 과정을 통해서 참여 학생의 창의적 능력을 키우며, 문제의 해결에 대한 능력 향상과 함께 팀활동을 체험한다.",
                  },
                },
                {
                  name: "미래설계탐색",
                  description: {
                    text: "스트롱 직업흥미검사를 온라인으로 실시하고, 해석 워크샵을 그 결과를 알게함으로써 자신의 직업적 흥미 경향성을 알아보고, 지속적인 상담 및 지도를 통해 자기를 이해하고 개인 가치관을 확립한다.",
                  },
                }
              ]
            },
            {
              name: "2학기",
              description: {
                text: "전공 필수 5학점, 전공 선택 1학점"
              },
              skills: [
                {
                  name: "컴퓨터시스템개론",
                  description: {
                    text: "컴퓨터에 대한 기초 지식을 부여하는 과목으로서 하드웨어, 소프트웨어 및 Firmware의 기능을 정의하고 프로그램과 컴퓨터 상호간에 관계 및 문제의 해결을 컴퓨터로 처리하는 방법을 습득한다.",
                  },
                },
                {
                  name: `오픈소스소프트웨어이해와실습`,
                  description: {
                    text: "IT분야에서 활발하게 사용되고 있는 오픈소스소프트웨어의 종류, 올바른 활용방법, 개발환경의 구성, 다양한 응용 등에 대해 학습하여 오픈소스소프트웨어에 대한 이해를 높이고 기본적인 활용방법을 배운다."
                  },
                },
                {
                  name: "미래설계준비",
                  description: {
                    text: "4차 산업혁명과 관련된 다양한 기술을 소개하여 학생들의 리더십 함양과 창의성과 융합 마인드 함양을 목적으로 한다. 최신 산업 동향에 대해 배우고 미래 경력을 더 잘 계획할 수 있는 방법을 습득한다.",
                  }
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}